DataProcessors/РаботасFTP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РаботасFTP</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/НастройкиFTP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиFTP</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Comment>Путь к каталогу на диске</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКопий</Name>
					<Comment>Путь к каталогу на диске для обработанных успешно файлов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/РаботасFTP/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправкаДанныхНаFTP(Команда)
	Если ЗначениеЗаполнено(НастройкаFTP) Тогда
		
		ПараметрыFTP=ОпределитьFTP(НастройкаFTP);
		FTPКлиент = Новый FTPСоединение(ПараметрыFTP.Сервер, ПараметрыFTP.Порт, ПараметрыFTP.Логин, ПараметрыFTP.Пароль, , , 30);
		Для каждого СтрокаТаблицы Из ТаблицаФайлов Цикл
			
			FTPКлиент.Записать(СтрокаТаблицы.ИмяФайлаДляОбработки,СтрокаТаблицы.Файл);
			
			
		КонецЦикла; 
		
	Иначе
		Сообщить("Укажите настройку FTP");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхСFTP(Команда)
	
	Если ЗначениеЗаполнено(НастройкаFTP) Тогда
		ПараметрыFTP=ОпределитьFTP(НастройкаFTP);
		FTPКлиент = Новый FTPСоединение(ПараметрыFTP.Сервер, ПараметрыFTP.Порт, ПараметрыFTP.Логин, ПараметрыFTP.Пароль, , , 30);
		
		Каталог = "/"+ПараметрыFTP.Путь;
		КаталогНовый = ПараметрыFTP.ПутьКопий;
		ТаблицаФайлов.Очистить();
		
		
		Результат = FTPКлиент.НайтиФайлы(Каталог, "*.*");
		Для Каждого Файл Из Результат Цикл
			СтрокаТаблицы = ТаблицаФайлов.Добавить();
			СтрокаТаблицы.Файл = Файл.ПолноеИмя;
			FTPКлиент.Получить(Файл.ПолноеИмя,СокрЛП(КаталогНовый) + Файл.Имя);
			СтрокаТаблицы.ИмяФайлаДляОбработки =СокрЛП(КаталогНовый)+Файл.Имя;
			FTPКлиент.Удалить(СтрокаТаблицы.Файл );
			//УдалитьФайлы(СтрокаТаблицы.ИмяФайлаДляОбработки);
			
		КонецЦикла;
		
		
	Иначе
		Сообщить("Укажите настройку FTP");
	КонецЕсли;	
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ОпределитьFTP(ТекущийFTP)
	ПараметрыFTP = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиFTP.Сервер КАК Сервер,
	|	НастройкиFTP.Порт КАК Порт,
	|	НастройкиFTP.Логин КАК Логин,
	|	НастройкиFTP.Пароль КАК Пароль,
	|	НастройкиFTP.Путь КАК Путь,
	|	НастройкиFTP.ПутьКопий КАК ПутьКопий
	|ИЗ
	|	Справочник.НастройкиFTP КАК НастройкиFTP
	|ГДЕ
	|	НастройкиFTP.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийFTP);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПараметрыFTP.Вставить("Сервер", ВыборкаДетальныеЗаписи.Сервер);
		ПараметрыFTP.Вставить("Порт",  Число(ВыборкаДетальныеЗаписи.Порт));
		ПараметрыFTP.Вставить("Логин", ВыборкаДетальныеЗаписи.Логин);
		ПараметрыFTP.Вставить("Пароль", ВыборкаДетальныеЗаписи.Пароль);
		ПараметрыFTP.Вставить("Путь", ВыборкаДетальныеЗаписи.Путь);
		ПараметрыFTP.Вставить("ПутьКопий", ВыборкаДетальныеЗаписи.ПутьКопий);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат ПараметрыFTP;
КонецФункции //
